docs/packages_game.dot
digraph "packages_game" {
rankdir=BT
charset="utf-8"
"modules" [color="black", label=<modules>, shape="box", style="solid"];
"modules.audio" [color="black", label=<modules.audio>, shape="box", style="solid"];
"modules.audio.audio_manager" [color="black", label=<modules.audio.audio_manager>, shape="box", style="solid"];
"modules.config" [color="black", label=<modules.config>, shape="box", style="solid"];
"modules.config.settings" [color="black", label=<modules.config.settings>, shape="box", style="solid"];
"modules.config.theme" [color="black", label=<modules.config.theme>, shape="box", style="solid"];
"modules.constants" [color="black", label=<modules.constants>, shape="box", style="solid"];
"modules.display" [color="black", label=<modules.display>, shape="box", style="solid"];
"modules.editor" [color="black", label=<modules.editor>, shape="box", style="solid"];
"modules.effects" [color="black", label=<modules.effects>, shape="box", style="solid"];
"modules.effects.score" [color="black", label=<modules.effects.score>, shape="box", style="solid"];
"modules.effects.score.bonus_rules" [color="black", label=<modules.effects.score.bonus_rules>, shape="box", style="solid"];
"modules.effects.score.score_manager" [color="black", label=<modules.effects.score.score_manager>, shape="box", style="solid"];
"modules.engine" [color="black", label=<modules.engine>, shape="box", style="solid"];
"modules.entities" [color="black", label=<modules.entities>, shape="box", style="solid"];
"modules.entities.actuators" [color="black", label=<modules.entities.actuators>, shape="box", style="solid"];
"modules.entities.actuators.actuator_base" [color="black", label=<modules.entities.actuators.actuator_base>, shape="box", style="solid"];
"modules.entities.actuators.flipper" [color="black", label=<modules.entities.actuators.flipper>, shape="box", style="solid"];
"modules.entities.actuators.plunger" [color="black", label=<modules.entities.actuators.plunger>, shape="box", style="solid"];
"modules.entities.ball" [color="black", label=<modules.entities.ball>, shape="box", style="solid"];
"modules.entities.obstacles" [color="black", label=<modules.entities.obstacles>, shape="box", style="solid"];
"modules.entities.obstacles.bumper" [color="black", label=<modules.entities.obstacles.bumper>, shape="box", style="solid"];
"modules.entities.obstacles.hole" [color="black", label=<modules.entities.obstacles.hole>, shape="box", style="solid"];
"modules.entities.obstacles.obstacle_base" [color="black", label=<modules.entities.obstacles.obstacle_base>, shape="box", style="solid"];
"modules.entities.obstacles.target" [color="black", label=<modules.entities.obstacles.target>, shape="box", style="solid"];
"modules.entities.player" [color="black", label=<modules.entities.player>, shape="box", style="solid"];
"modules.entities.tiles" [color="black", label=<modules.entities.tiles>, shape="box", style="solid"];
"modules.events" [color="black", label=<modules.events>, shape="box", style="solid"];
"modules.events.actions" [color="black", label=<modules.events.actions>, shape="box", style="solid"];
"modules.events.io" [color="black", label=<modules.events.io>, shape="box", style="solid"];
"modules.game" [color="black", label=<modules.game>, shape="box", style="solid"];
"modules.input" [color="black", label=<modules.input>, shape="box", style="solid"];
"modules.input.input_handler" [color="black", label=<modules.input.input_handler>, shape="box", style="solid"];
"modules.physics" [color="black", label=<modules.physics>, shape="box", style="solid"];
"modules.physics.collision_manager" [color="black", label=<modules.physics.collision_manager>, shape="box", style="solid"];
"modules.physics.physics_engine" [color="black", label=<modules.physics.physics_engine>, shape="box", style="solid"];
"modules.physics.trajectory_controller" [color="black", label=<modules.physics.trajectory_controller>, shape="box", style="solid"];
"modules.ui" [color="black", label=<modules.ui>, shape="box", style="solid"];
"modules.ui.background" [color="black", label=<modules.ui.background>, shape="box", style="solid"];
"modules.ui.menu" [color="black", label=<modules.ui.menu>, shape="box", style="solid"];
"modules.ui.panel" [color="black", label=<modules.ui.panel>, shape="box", style="solid"];
"modules.ui.stage" [color="black", label=<modules.ui.stage>, shape="box", style="solid"];
"modules.utils" [color="black", label=<modules.utils>, shape="box", style="solid"];
"modules.display" -> "modules.constants" [arrowhead="open", arrowtail="none"];
"modules.engine" -> "modules.display" [arrowhead="open", arrowtail="none"];
"modules.engine" -> "modules.events.actions" [arrowhead="open", arrowtail="none"];
"modules.engine" -> "modules.events.io" [arrowhead="open", arrowtail="none"];
"modules.engine" -> "modules.game" [arrowhead="open", arrowtail="none"];
"modules.entities.actuators.flipper" -> "modules.entities.actuators.actuator_base" [arrowhead="open", arrowtail="none"];
"modules.entities.actuators.plunger" -> "modules.entities.actuators.actuator_base" [arrowhead="open", arrowtail="none"];
"modules.entities.obstacles.bumper" -> "modules.entities.obstacles.obstacle_base" [arrowhead="open", arrowtail="none"];
"modules.entities.obstacles.hole" -> "modules.entities.obstacles.obstacle_base" [arrowhead="open", arrowtail="none"];
"modules.entities.obstacles.target" -> "modules.entities.obstacles.obstacle_base" [arrowhead="open", arrowtail="none"];
"modules.game" -> "modules.display" [arrowhead="open", arrowtail="none"];
"modules.game" -> "modules.entities.player" [arrowhead="open", arrowtail="none"];
"modules.game" -> "modules.entities.tiles" [arrowhead="open", arrowtail="none"];
"modules.game" -> "modules.ui.panel" [arrowhead="open", arrowtail="none"];
"modules.game" -> "modules.ui.stage" [arrowhead="open", arrowtail="none"];
"modules.physics.trajectory_controller" -> "modules.physics.collision_manager" [arrowhead="open", arrowtail="none"];
"modules.ui.stage" -> "modules.ui.background" [arrowhead="open", arrowtail="none"];
}
